tap "aws/tap"
tap "modularml/packages"
tap "oven-sh/bun"
brew "cmake"
brew "git-secrets"
brew "gnupg"
brew "neovim"
brew "tree"
cask "font-0xproto-nerd-font"
cask "font-daddy-time-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-myrica" 
cask "ghostty"
cask "raycast"
vscode "arrterian.nix-env-selector"
vscode "bbenoist.nix"
vscode "be5invis.toml"
vscode "christian-kohler.path-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "dsznajder.es7-react-js-snippets"
vscode "durzn.brackethighlighter"
vscode "formulahendry.auto-rename-tag"
vscode "jebbs.plantuml"
vscode "jnoortheen.nix-ide"
vscode "mkhl.direnv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vsliveshare.vsliveshare"
vscode "oderwat.indent-rainbow"
vscode "orsenkucher.vscode-graphql"
vscode "pinage404.nix-extension-pack"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "streetsidesoftware.code-spell-checker"
vscode "twxs.cmake"
vscode "unifiedjs.vscode-mdx"
vscode "vadimcn.vscode-lldb"
vscode "voldemortensen.rainbow-tags"
vscode "zhuangtongfa.material-theme"
